using Tyuiu.PupovAA.Sprint1.Task7.V16.Lib;
internal class Program
{
    private static void Main(string[] args)
    {
        DataService ds = new DataService();
        Console.Title = "Спринт #1 | Выполнил: Пупов А. А. | ИБКСб-25-1";
        Console.WriteLine("************************************************************************************************");
        Console.WriteLine("* Спринт #1                                                                                    *");
        Console.WriteLine("* Тема: Добавление к решению итоговых проектов по спринту                                      *");
        Console.WriteLine("* Задание #7                                                                                   *");
        Console.WriteLine("* Вариант #16                                                                                  *");
        Console.WriteLine("* Выполнил: Пупов Артём Андреевич | ИБКСб-25-1                                                 *");
        Console.WriteLine("************************************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                                     *");
        Console.WriteLine("* Написать программу, которая вычисляет математическое выражение по исходным значениям данных, *");
        Console.WriteLine("*  вводимых пользователем. Ответ округлите до 3 знаков после запятой.                          *");
        Console.WriteLine("************************************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                             *");
        Console.WriteLine("************************************************************************************************");
        double x;
        Console.WriteLine("Введите число ");
        x = Convert.ToDouble(Console.ReadLine());
        Console.WriteLine("************************************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                   *");
        Console.WriteLine("************************************************************************************************");
        Console.Write("Вычислив по данной нам формуле, мы получили число z = ");
        Console.Write(ds.Calculate(x));
        Console.ReadKey();

    }
}